micro/example/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Script: makeMesh.py                             |
|   \  /    A nd           | Time: 2026-05-08 13:15:36.112745                |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
	(0.00000000 0.00000000 0.10000000) // 0
	(1.00000000 0.00000000 0.10000000) // 1
	(1.00000000 0.00000000 0.00000000) // 2
	(0.00000000 0.00000000 0.00000000) // 3
	(0.00000000 0.10000000 0.10000000) // 4
	(1.00000000 0.10000000 0.10000000) // 5
	(1.00000000 0.10000000 0.00000000) // 6
	(0.00000000 0.10000000 0.00000000) // 7
);

blocks
(
	hex ( 0 1 2 3 4 5 6 7 )  ( 100 10 12 ) simpleGrading ( 1 1 ((0.1 4 1) (0.8 4 1) (0.1 4 1))) // 0 
);

edges
(
);

boundary
(
	lowerWall
	{
		type wall;
		faces
		(
			(0 1 2 3)
		);
	}

	upperWall
	{
		type wall;
		faces
		(
			(4 5 6 7)
		);
	}

	frontAndBack
	{
		type empty;
		faces
		(
			(4 5 1 0)
			(7 6 2 3)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			(5 1 2 6)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			(4 0 3 7)
		);
	}

);

faces
(
);

mergePatchPairs
(
);

scale 1;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Created with classy_blocks: https://github.com/damogranlabs/classy_blocks //
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
